pI_Sd = ; % ток на статоре по оси d   !!!!!
pI_Sq = ; % ток на статоре по оси q   !!!!!
plll_R= ; % потокосцепление на роторе   !!!!!
omega_e = ; % скорость поля на статоре   !!!!!
M_em = ; % электромагнитный момент двигателя   !!!!!
L_S = 0.4723; % индуктивность на статоре  ?????
Lr = 0.5151; % индуктивность на роторе  ?????
L_m = 0.984; % индуктивность намагничивания двигателя  ?????
K_R = 0.1301; % коэффицент ротора  ?????
R_S = 0.1545; % сопротивление статора  ?????
I_Sd = ; % ток на статоре по оси d   !!!!!
I_Sq = ; % ток на статоре по оси q   !!!!!
lll_R= 93.0246; % потокосцепление на роторе   !!!!!
T_R = Lm/R; % постоянная времени обмотки возбуждения   !!!!!!
Z_P = 1; % число пар полюсов двигателя
omega_R = 308.9233; % угловая скорость ротора  ?????
Rr = 0.067






















